# Energy Data Settings Get Energy Data Settings Method

Source: https://www.revitapidocs.com/2026/d7fd4001-4bd7-7b38-1800-0b03baf989ec.htm

---

| Energy Data Settings Get Energy Data Settings Method |
| --- |

Gets the energy data settings element in the document.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static EnergyDataSettings GetEnergyDataSettings(
	Document doc
)
```

```
Public Shared Function GetEnergyDataSettings (
	doc As Document
) As EnergyDataSettings
```

```
public:
static EnergyDataSettings^ GetEnergyDataSettings(
	Document^ doc
)
```

```
static member GetEnergyDataSettings :
        doc : Document -> EnergyDataSettings
```

#### Parameters

doc Document
:   The document where the settings element is found.

#### Return Value

EnergyDataSettings
The element which stores the energy data settings for the document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

EnergyDataSettings Class Autodesk.Revit.DB.Analysis Namespace